export const JOB_CODE_MAP: Record<string, string> = {
    '0013001': '재직자',
    '0013002': '자영업자',
    '0013003': '미취업자', // 구직중, 학생 포함
    '0013004': '프리랜서',
    '0013006': '창업자(예비)',
    '0013010': '제한없음',
};

export const EDUCATION_CODE_MAP: Record<string, string> = {
    '0049001': '고졸 미만',
    '0049002': '고교 재학',
    '0049003': '고졸 예정',
    '0049004': '고교 졸업',
    '0049005': '대학 재학', // 대학 휴학 포함
    '0049006': '대졸 예정',
    '0049007': '대학 졸업',
    '0049008': '석박사',
    '0049010': '제한없음',
};

export const MARRIAGE_CODE_MAP: Record<string, string> = {
    '0055001': '기혼',
    '0055002': '미혼',
    '0055003': '제한없음',
};

export const INCOME_CODE_MAP: Record<string, string> = {
    '0043001': '소득무관',
    '0043002': '기준중위소득 50% 이하',
    '0043003': '기준중위소득 50% ~ 100%',
    '0043004': '기준중위소득 100% ~ 150%',
    '0043005': '기준중위소득 150% 초과',
};
